
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("НеНайденОператорПопытка")
		.ДобавитьТест("НеНайденОператорПопыткаРазныеПроцедуры")
		.ДобавитьТест("НеНайденОператорПопыткаВоВложенномУсловии")
		.ДобавитьТест("МеждуНачатьТранзакциюИПопыткаЕстьИсполняемыйКод")
		.ДобавитьТест("МеждуНачатьТранзакциюИПопыткаЕстьКомментарии")
		.ДобавитьТест("ТранзакцияВУсловии")
		.ДобавитьТест("ТранзакцияВУсловииИначеЕсли")
		.ДобавитьТест("ТранзакцияВУсловииИначе")
		.ДобавитьТест("ТранзакцияВоВложенномУсловии")
		.ДобавитьТест("ТранзакцияВЦиклеПока")
		.ДобавитьТест("ТранзакцияВЦиклеДля")
	;
	
КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	
	Проект = ЮТест.Данные().КонструкторОбъекта("Справочник.Радар_Проекты")
		.Записать()
	;
	Плагин = ЮТест.Данные().КонструкторОбъекта("Справочник.Радар_Плагины")
		.Установить("Владелец", Проект)
		.Установить("Путь", "D:\1cv8\radar.zerobig\bin\Плагины\НачатьТранзакцию.epf")
		.Записать()
	;

	Плагины = Радар_Кэш.Плагины(Проект);

	Парсер = Обработки.Радар_ПарсерВстроенногоЯзыка.Создать();
	Парсер.Подключить(Плагины);
	
	Контекст = ЮТест.Контекст();
	Контекст.УстановитьЗначение("Парсер", Парсер);
	
КонецПроцедуры

Процедура НеНайденОператорПопытка() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	НачатьТранзакцию();
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("Не найден оператор ""Попытка"" после вызова ""НачатьТранзакцию()"""))
	;
	
КонецПроцедуры

Процедура НеНайденОператорПопыткаРазныеПроцедуры() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	НачатьТранзакцию();
	|КонецПроцедуры // Тест
	|
	|Процедура Тест2()
	|	НачатьТранзакцию();
	|КонецПроцедуры // Тест2";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(2)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("Не найден оператор ""Попытка"" после вызова ""НачатьТранзакцию()"""))
	;
	
КонецПроцедуры

Процедура НеНайденОператорПопыткаВоВложенномУсловии() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = 1;
	|	Если а = 1 Тогда
	|		Если а = 1 Тогда
	|			НачатьТранзакцию();
	|		КонецЕсли;
	|	КонецЕсли;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("Не найден оператор ""Попытка"" после вызова ""НачатьТранзакцию()"""))
	;
	
КонецПроцедуры

Процедура МеждуНачатьТранзакциюИПопыткаЕстьИсполняемыйКод() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	НачатьТранзакцию();
	|	а = 1;
	|	Попытка
	|	// ...
	|	ЗафиксироватьТранзакцию();
	|	Исключение
	|	// ...
	|	ОтменитьТранзакцию();
	|	// ...
	|	ВызватьИсключение;
	|	КонецПопытки;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("Между ""НачатьТранзакцию()"" и ""Попытка"" есть исполняемый код"))
	;
	
КонецПроцедуры

Процедура МеждуНачатьТранзакциюИПопыткаЕстьКомментарии() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	НачатьТранзакцию();
	|	// Комментарий между ""НачатьТранзакцию()"" и ""Попытка""
	|	Попытка
	|	// ...
	|	ЗафиксироватьТранзакцию();
	|	Исключение
	|	// ...
	|	ОтменитьТранзакцию();
	|	// ...
	|	ВызватьИсключение;
	|	КонецПопытки;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура ТранзакцияВУсловии() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = 1;
	|	Если а = 1 Тогда
	|		НачатьТранзакцию();
	|		Попытка
	|		// ...
	|		ЗафиксироватьТранзакцию();
	|		Исключение
	|		// ...
	|		ОтменитьТранзакцию();
	|		// ...
	|		ВызватьИсключение;
	|		КонецПопытки;
	|	КонецЕсли;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура ТранзакцияВУсловииИначеЕсли() Экспорт

	ТекстМодуля = "Процедура Тест()
	|	а = 1;
	|	Если а = 1 Тогда
	|	ИначеЕсли а = 2 Тогда
	|		НачатьТранзакцию();
	|		Попытка
	|		// ...
	|		ЗафиксироватьТранзакцию();
	|		Исключение
	|		// ...
	|		ОтменитьТранзакцию();
	|		// ...
	|		ВызватьИсключение;
	|		КонецПопытки;
	|	КонецЕсли;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;

КонецПроцедуры

Процедура ТранзакцияВУсловииИначе() Экспорт

	ТекстМодуля = "Процедура Тест()
	|	а = 1;
	|	Если а = 1 Тогда
	|	Иначе
	|		НачатьТранзакцию();
	|		Попытка
	|		// ...
	|		ЗафиксироватьТранзакцию();
	|		Исключение
	|		// ...
	|		ОтменитьТранзакцию();
	|		// ...
	|		ВызватьИсключение;
	|		КонецПопытки;
	|	КонецЕсли;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;

КонецПроцедуры

Процедура ТранзакцияВоВложенномУсловии() Экспорт

	ТекстМодуля = "Процедура Тест()
	|	а = 1;
	|	Если а = 1 Тогда
	|		Если а = 1 Тогда
	|			НачатьТранзакцию();
	|			Попытка
	|			// ...
	|			ЗафиксироватьТранзакцию();
	|			Исключение
	|			// ...
	|			ОтменитьТранзакцию();
	|			// ...
	|			ВызватьИсключение;
	|			КонецПопытки;
	|		КонецЕсли;
	|	КонецЕсли;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;

КонецПроцедуры

Процедура ТранзакцияВЦиклеПока() Экспорт

	ТекстМодуля = "Процедура Тест()
	|	а = 1;
	|	Пока а = 1 Цикл
	|		НачатьТранзакцию();
	|		Попытка
	|		// ...
	|		ЗафиксироватьТранзакцию();
	|		Исключение
	|		// ...
	|		ОтменитьТранзакцию();
	|		// ...
	|		ВызватьИсключение;
	|		КонецПопытки;
	|	КонецЦикла;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;

КонецПроцедуры

Процедура ТранзакцияВЦиклеДля() Экспорт

	ТекстМодуля = "Процедура Тест()
	|	а = 1;
	|	Для Сч = 1 По 5 Цикл
	|		НачатьТранзакцию();
	|		Попытка
	|		// ...
	|		ЗафиксироватьТранзакцию();
	|		Исключение
	|		// ...
	|		ОтменитьТранзакцию();
	|		// ...
	|		ВызватьИсключение;
	|		КонецПопытки;
	|	КонецЦикла;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");

	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;

КонецПроцедуры

#КонецОбласти