
Перем ТаблицаОшибок;
Перем Типы;

Перем ИменаКонструктораСтруктуры;

Процедура Открыть(Парсер, Параметры) Экспорт
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	Типы = Парсер.Типы();
	
	ИменаКонструктораСтруктуры = Новый Структура;
	ИменаКонструктораСтруктуры.Вставить("структура");
	ИменаКонструктораСтруктуры.Вставить("structure");
КонецПроцедуры

Функция Закрыть() Экспорт
	Возврат Неопределено;
КонецФункции

Функция Подписки() Экспорт
	Перем Подписки;
	Подписки = Новый Массив;
	Подписки.Добавить("ПосетитьВыражениеНовый");
	Возврат Подписки;
КонецФункции

#Область РеализацияПодписок

Процедура ПосетитьВыражениеНовый(ВыражениеНовый) Экспорт
	
	Если Не ИменаКонструктораСтруктуры.Свойство(НРег(ВыражениеНовый.Имя)) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыражениеНовый.Аргументы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйАргумент = ВыражениеНовый.Аргументы[0].Элементы;
	ЗначениеПервогоАргумента = "";
	Для каждого СтрокаАргумента Из ПервыйАргумент Цикл
		ЗначениеПервогоАргумента = ЗначениеПервогоАргумента + СтрокаАргумента.Значение;
	КонецЦикла;
	
	МассивПолейСтруктуры = СтрРазделить(ЗначениеПервогоАргумента, ",");
	Если МассивПолейСтруктуры.Количество() > 3 Тогда
		Ошибка("Конструктор структуры содержит более чем три ключа", ВыражениеНовый.Начало, ВыражениеНовый.Конец);
	КонецЕсли;
	
	Если ВыражениеНовый.Аргументы.Количество() > 1 Тогда
		Для Сч = 1 По ВыражениеНовый.Аргументы.ВГраница() Цикл
			
			Аргумент = ВыражениеНовый.Аргументы[Сч];
			Если Аргумент.Тип = Типы.ВыражениеНовый И Аргумент.Аргументы.Количество() > 0 Тогда
				Ошибка("В конструкторе структуры не рекомендуется использовать конструкторы других объектов, если эти конструкторы принимают параметры",
					Аргумент.Начало, Аргумент.Конец);
			ИначеЕсли Аргумент.Тип = Типы.ВыражениеИдентификатор И Аргумент.Аргументы.Количество() > 3 Тогда
				Ошибка("В конструкторе структуры не рекомендуется использовать функции с более чем тремя параметрами",
					Аргумент.Начало, Аргумент.Конец);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // РеализацияПодписок

Процедура Ошибка(Текст, Начало, Конец = Неопределено, ЕстьЗамена = Ложь)
	
	Ошибка = ТаблицаОшибок.Добавить();
	Ошибка.Источник = Метаданные().Имя;
	Ошибка.Текст = Текст;
	
	Ошибка.МинутНаИсправление = 5;
	Ошибка.Серьезность = "MINOR";
	Ошибка.Приоритет = 0;
	Ошибка.Правило = Метаданные().Синоним;
	Ошибка.Тип = "CODE_STYLE";
	
	Ошибка.ПозицияНачала = Начало.Позиция;
	Ошибка.НомерСтрокиНачала = Начало.НомерСтроки;
	Ошибка.НомерКолонкиНачала = Начало.НомерКолонки;
	Если Конец = Неопределено Или Конец = Начало Тогда
		Ошибка.ПозицияКонца = Начало.Позиция + Начало.Длина;
		Ошибка.НомерСтрокиКонца = Начало.НомерСтроки;
		Ошибка.НомерКолонкиКонца = Начало.НомерКолонки + Начало.Длина;
	Иначе
		Ошибка.ПозицияКонца = Конец.Позиция + Конец.Длина;
		Ошибка.НомерСтрокиКонца = Конец.НомерСтроки;
		Ошибка.НомерКолонкиКонца = Конец.НомерКолонки + Конец.Длина;
	КонецЕсли;
	
	Ошибка.ЕстьЗамена = ЕстьЗамена;
	
КонецПроцедуры