Перем ТаблицаОшибок;
Перем Стек;
Перем Типы;

Перем ИменаМетодовФиксацииТранзакции;

Процедура Открыть(Парсер, Параметры) Экспорт
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	Стек = Парсер.Стек();
	Типы = Парсер.Типы();
	
	ИменаМетодовФиксацииТранзакции = Новый Структура;
	ИменаМетодовФиксацииТранзакции.Вставить("зафиксироватьтранзакцию");
	ИменаМетодовФиксацииТранзакции.Вставить("committransaction");
КонецПроцедуры

Функция Закрыть() Экспорт
	Возврат Неопределено;
КонецФункции

Функция Подписки() Экспорт
	Перем Подписки;
	Подписки = Новый Массив;
	Подписки.Добавить("ПосетитьВыражениеИдентификатор");
	Возврат Подписки;
КонецФункции

#Область РеализацияПодписок

Процедура ПосетитьВыражениеИдентификатор(ВыражениеИдентификатор) Экспорт
	
	Если Не ИменаМетодовФиксацииТранзакции.Свойство(НРег(ВыражениеИдентификатор.Голова.Имя)) Тогда
		Возврат;
	КонецЕсли;
	
	Если Стек.Количество() > 1 И Не Стек[Стек.ВГраница() - 1].Тип = Типы.ОператорПопытка Тогда
		Ошибка("Вызов ""ЗафиксироватьТранзакцию()"" находится вне конструкции ""Попытка... Исключение""",
			ВыражениеИдентификатор.Начало, ВыражениеИдентификатор.Конец);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // РеализацияПодписок

Процедура Ошибка(Текст, Начало, Конец = Неопределено, ЕстьЗамена = Ложь)
	
	Ошибка = ТаблицаОшибок.Добавить();
	Ошибка.Источник = Метаданные().Имя;
	Ошибка.Текст = Текст;
	
	Ошибка.МинутНаИсправление = 5;
	Ошибка.Серьезность = "MINOR";
	Ошибка.Приоритет = 0;
	Ошибка.Правило = Метаданные().Синоним;
	Ошибка.Тип = "WARNING";
	
	Ошибка.ПозицияНачала = Начало.Позиция;
	Ошибка.НомерСтрокиНачала = Начало.НомерСтроки;
	Ошибка.НомерКолонкиНачала = Начало.НомерКолонки;
	Если Конец = Неопределено Или Конец = Начало Тогда
		Ошибка.ПозицияКонца = Начало.Позиция + Начало.Длина;
		Ошибка.НомерСтрокиКонца = Начало.НомерСтроки;
		Ошибка.НомерКолонкиКонца = Начало.НомерКолонки + Начало.Длина;
	Иначе
		Ошибка.ПозицияКонца = Конец.Позиция + Конец.Длина;
		Ошибка.НомерСтрокиКонца = Конец.НомерСтроки;
		Ошибка.НомерКолонкиКонца = Конец.НомерКолонки + Конец.Длина;
	КонецЕсли;
	
	Ошибка.ЕстьЗамена = ЕстьЗамена;
	
КонецПроцедуры
