
Перем ТаблицаОшибок;
Перем Стек;
Перем Типы;
Перем Узлы;

Перем ИменаМетодовНачалаТранзакции;

Процедура Открыть(Парсер, Параметры) Экспорт
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	Стек = Парсер.Стек();
	Типы = Парсер.Типы();
	Узлы = Парсер.Узлы();
	
	ИменаМетодовНачалаТранзакции = Новый Структура;
	ИменаМетодовНачалаТранзакции.Вставить("НачатьТранзакцию");
	ИменаМетодовНачалаТранзакции.Вставить("BeginTransaction");
КонецПроцедуры

Функция Закрыть() Экспорт
	Возврат Неопределено;
КонецФункции

Функция Подписки() Экспорт
	Перем Подписки;
	Подписки = Новый Массив;
	Подписки.Добавить("ПосетитьВыражениеИдентификатор");
	Возврат Подписки;
КонецФункции

#Область РеализацияПодписок

Процедура ПосетитьВыражениеИдентификатор(ВыражениеИдентификатор) Экспорт
	
	Если Не ИменаМетодовНачалаТранзакции.Свойство(ВыражениеИдентификатор.Голова.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Стек[Стек.ВГраница()];
	Следующий = СледующийОператор(Родитель);
	Если Следующий = Неопределено Или Следующий = Null Тогда
		Ошибка("Не найден оператор ""Попытка"" после вызова ""НачатьТранзакцию()""", ВыражениеИдентификатор.Начало, ВыражениеИдентификатор.Конец);
	ИначеЕсли Не Следующий.Тип = Типы.ОператорПопытка Тогда
		Ошибка("Между ""НачатьТранзакцию()"" и ""Попытка"" есть исполняемый код", ВыражениеИдентификатор.Начало, ВыражениеИдентификатор.Конец);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // РеализацияПодписок

Функция СледующийОператор(Оператор)
	
	Объявления = Узлы.Модуль[0].Объявления;
	Для каждого Объявление Из Объявления Цикл
		
		Если Не Объявление.Тип = Типы.ОбъявлениеМетода Тогда
			Продолжить;
		КонецЕсли;
		
		Операторы = Объявление.Операторы;
		РезультатПоиска = НайтиОператорРекурсивно(Операторы, Оператор);
		Если Не РезультатПоиска = Неопределено Тогда
			Возврат РезультатПоиска;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиОператорРекурсивно(Операторы, Элемент)
	
	ИндексОператора = Операторы.Найти(Элемент);
	Если Не ИндексОператора = Неопределено Тогда
		Если Операторы.Количество() - 1 > ИндексОператора Тогда
			Возврат Операторы[ИндексОператора + 1];
		КонецЕсли;
		
		// Нашли. Дальше искать смысла нет. Но следующего оператора тоже нет.
		// Потому возвращаем вот такой необычный результат чтобы прервать рекурсию.
		Возврат Null;
	КонецЕсли;
	
	Для каждого Оператор Из Операторы Цикл
		Если Оператор.Тип = Типы.ОператорЕсли Тогда
			РезультатПоиска = НайтиОператорРекурсивно(Оператор.Тогда, Элемент);
			Если РезультатПоиска = Неопределено И Не Оператор.ИначеЕсли = Неопределено Тогда
				РезультатПоиска = НайтиОператорРекурсивно(Оператор.ИначеЕсли, Элемент);
			КонецЕсли;
			Если РезультатПоиска = Неопределено И Не Оператор.Иначе = Неопределено Тогда
				РезультатПоиска = НайтиОператорРекурсивно(Оператор.Иначе.Операторы, Элемент);
			КонецЕсли;
		ИначеЕсли Оператор.Тип = Типы.ОператорИначеЕсли Тогда
			РезультатПоиска = НайтиОператорРекурсивно(Оператор.Тогда, Элемент);
		ИначеЕсли Оператор.Тип = Типы.ОператорПока Или
			Оператор.Тип = Типы.ОператорДля Или
			Оператор.Тип = Типы.ОператорДляКаждого Тогда

			РезультатПоиска = НайтиОператорРекурсивно(Оператор.Операторы, Элемент);
		КонецЕсли;
		
		Если Не РезультатПоиска = Неопределено Тогда
			Возврат РезультатПоиска;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура Ошибка(Текст, Начало, Конец = Неопределено, ЕстьЗамена = Ложь)
	
	Ошибка = ТаблицаОшибок.Добавить();
	Ошибка.Источник = Метаданные().Имя;
	Ошибка.Текст = Текст;
	
	Ошибка.МинутНаИсправление = 5;
	Ошибка.Серьезность = "MINOR";
	Ошибка.Приоритет = 0;
	Ошибка.Правило = Метаданные().Синоним;
	Ошибка.Тип = "WARNING";
	
	Ошибка.ПозицияНачала = Начало.Позиция;
	Ошибка.НомерСтрокиНачала = Начало.НомерСтроки;
	Ошибка.НомерКолонкиНачала = Начало.НомерКолонки;
	Если Конец = Неопределено Или Конец = Начало Тогда
		Ошибка.ПозицияКонца = Начало.Позиция + Начало.Длина;
		Ошибка.НомерСтрокиКонца = Начало.НомерСтроки;
		Ошибка.НомерКолонкиКонца = Начало.НомерКолонки + Начало.Длина;
	Иначе
		Ошибка.ПозицияКонца = Конец.Позиция + Конец.Длина;
		Ошибка.НомерСтрокиКонца = Конец.НомерСтроки;
		Ошибка.НомерКолонкиКонца = Конец.НомерКолонки + Конец.Длина;
	КонецЕсли;
	
	Ошибка.ЕстьЗамена = ЕстьЗамена;
	
КонецПроцедуры