#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("КорректныйПример")
		.ДобавитьТест("КорректныйПримерБезАргументов")
		.ДобавитьТест("КорректныйПримерСПустымМассивомАргументов")
		.ДобавитьТест("КорректныйПримерСПереносомСтроки")
		.ДобавитьТест("КорректныйПримерСПереносомСтрокиИЗначениями")
		.ДобавитьТест("СлишкомМногоКлючей")
		.ДобавитьТест("СлишкомМногоКлючейСПереносомСтроки")
		.ДобавитьТест("СлишкомМногоКлючейСПереносомСтрокиИЗначениями")
		.ДобавитьТест("ВКонструктореПрисутствуютКонструкторыДругихОбъектовБезПараметров")
		.ДобавитьТест("ВКонструктореПрисутствуютКонструкторыДругихОбъектовСПараметрами")
		.ДобавитьТест("ВКонструктореПрисутствуютФункцииБезПараметров")
		.ДобавитьТест("ВКонструктореПрисутствуютФункцииСТремяПараметрами")
		.ДобавитьТест("ВКонструктореПрисутствуютФункцииСЧетыремяПараметрами")
	;
	
КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	
	Проект = ЮТест.Данные().КонструкторОбъекта("Справочник.Радар_Проекты")
		.Записать()
	;
	Плагин = ЮТест.Данные().КонструкторОбъекта("Справочник.Радар_Плагины")
		.Установить("Владелец", Проект)
		.Установить("Путь", "D:\1cv8\radar.zerobig\bin\Плагины\СтруктураКонструктор.epf")
		.Записать()
	;

	Плагины = Радар_Кэш.Плагины(Проект);

	Парсер = Обработки.Радар_ПарсерВстроенногоЯзыка.Создать();
	Парсер.Подключить(Плагины);
	
	Контекст = ЮТест.Контекст();
	Контекст.УстановитьЗначение("Парсер", Парсер);
	
КонецПроцедуры

Процедура КорректныйПример() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1, Поле2, Поле3"");
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура КорректныйПримерБезАргументов() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура КорректныйПримерСПустымМассивомАргументов() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура();
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура КорректныйПримерСПереносомСтроки() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1, Поле2,
	|		|Поле3"");
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура КорректныйПримерСПереносомСтрокиИЗначениями() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1, Поле2,
	|		|Поле3"", 1, 2, 3);
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура СлишкомМногоКлючей() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1, Поле2, Поле3, Поле4"");
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("Конструктор структуры содержит более чем три ключа"))
	;
	
КонецПроцедуры

Процедура СлишкомМногоКлючейСПереносомСтроки() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1, Поле2,
	|		|Поле3, Поле4"");
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("Конструктор структуры содержит более чем три ключа"))
	;
	
КонецПроцедуры

Процедура СлишкомМногоКлючейСПереносомСтрокиИЗначениями() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1, Поле2,
	|		|Поле3, Поле4"", 1, 2, 3, 4);
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("Конструктор структуры содержит более чем три ключа"))
	;
	
КонецПроцедуры

Процедура ВКонструктореПрисутствуютКонструкторыДругихОбъектовБезПараметров() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1"", Новый Структура);
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура ВКонструктореПрисутствуютКонструкторыДругихОбъектовСПараметрами() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1"", Новый Структура(""СубПоле1""));
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("В конструкторе структуры не рекомендуется использовать конструкторы других объектов, если эти конструкторы принимают параметры"))
	;
	
КонецПроцедуры

Процедура ВКонструктореПрисутствуютФункцииБезПараметров() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1"", ТестоваяФункция());
	|КонецПроцедуры
	|
	|Функция ТестоваяФункция()
	|	Возврат ""ЗначениеПоля1"";
	|КонецФункции";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура ВКонструктореПрисутствуютФункцииСТремяПараметрами() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1"", ТестоваяФункция(""ПараметрФункции1"", ""ПараметрФункции2"", ""ПараметрФункции3""));
	|КонецПроцедуры
	|
	|Функция ТестоваяФункция(Параметр2, Параметр1, Параметр3)
	|	Возврат ""ЗначениеПоля1"";
	|КонецФункции";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура ВКонструктореПрисутствуютФункцииСЧетыремяПараметрами() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	а = Новый Структура(""Поле1"",
	|		ТестоваяФункция(
	|			""ПараметрФункции1"",
	|			""ПараметрФункции2"",
	|			""ПараметрФункции3"",
	|			""ПараметрФункции4""));
	|КонецПроцедуры
	|
	|Функция ТестоваяФункция(Параметр1, Параметр2, Параметр3, Параметр4)
	|	Возврат ""ЗначениеПоля1"";
	|КонецФункции";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("В конструкторе структуры не рекомендуется использовать функции с более чем тремя параметрами"))
	;
	
КонецПроцедуры

#КонецОбласти
