#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("КорректныйПример")
		.ДобавитьТест("НеНайденОператорПопытка")
	;
	
КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	
	Проект = ЮТест.Данные().КонструкторОбъекта("Справочник.Радар_Проекты")
		.Записать()
	;
	Плагин = ЮТест.Данные().КонструкторОбъекта("Справочник.Радар_Плагины")
		.Установить("Владелец", Проект)
		.Установить("Путь", "D:\1cv8\radar.zerobig\bin\Плагины\ОтменитьТранзакцию.epf")
		.Записать()
	;

	Плагины = Радар_Кэш.Плагины(Проект);

	Парсер = Обработки.Радар_ПарсерВстроенногоЯзыка.Создать();
	Парсер.Подключить(Плагины);
	
	Контекст = ЮТест.Контекст();
	Контекст.УстановитьЗначение("Парсер", Парсер);
	
КонецПроцедуры

Процедура КорректныйПример() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	НачатьТранзакцию();
	|	Попытка
	|	Исключение
	|		ОтменитьТранзакцию();
	|	КонецПопытки;
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(0)
	;
	
КонецПроцедуры

Процедура НеНайденОператорПопытка() Экспорт
	
	ТекстМодуля = "Процедура Тест()
	|	НачатьТранзакцию();
	|	ОтменитьТранзакцию();
	|КонецПроцедуры";
	
	Контекст = ЮТест.Контекст();
	Парсер = Контекст.Значение("Парсер");
	
	Модуль = Парсер.Разобрать(ТекстМодуля, Неопределено);
	Парсер.Посетить(Модуль); 
	
	ТаблицаОшибок = Парсер.ТаблицаОшибок();
	
	ЮТест.ОжидаетЧто(ТаблицаОшибок)
		.ИмеетДлину(1)
		.Содержит(ЮТест.Предикат()
			.Реквизит("Текст").Равно("Вызов ""ОтменитьТранзакцию()"" находится вне конструкции ""Попытка... Исключение"""))
	;
	
КонецПроцедуры

#КонецОбласти
