
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		Проект = Параметры.Отбор.Владелец;
	КонецЕсли;
	
	// TODO: Недоступность кнопки загрузки если владелец (проект) не выбран.
	//       Или, как вариант, при загрузке спросить в какой проект загружать.
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПлагиныИзКаталога(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборКаталога", ЭтотОбъект);

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКаталога(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьПоискФайлов", ЭтотОбъект);
		НачатьПоискФайлов(ОписаниеОповещения, Результат[0], "*.epf", Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПоискФайлов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СписокФайлов = Новый СписокЗначений;
		Для каждого Файл Из Результат Цикл
			СписокФайлов.Добавить(Файл.ПолноеИмя, Файл.ИмяБезРасширения);
		КонецЦикла;
		
		РезультатЗагрузки = ЗагрузитьПлагиныИзКаталогаСервер(СписокФайлов);
		
		Сообщить(РезультатЗагрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьПлагиныИзКаталогаСервер(СписокФайлов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Плагины.Ссылка КАК Ссылка,
	|	Плагины.Наименование КАК Наименование,
	|	Плагины.Путь КАК Путь
	|ИЗ
	|	Справочник.Радар_Плагины КАК Плагины
	|ГДЕ
	|	Плагины.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Проект);
	ТаблицаПлагинов = Запрос.Выполнить().Выгрузить();
	
	СчДобавленных = 0; СчОбновленных = 0;
	
	Для каждого Файл Из СписокФайлов Цикл
		
		СтрокиПлагинов = ТаблицаПлагинов.НайтиСтроки(Новый Структура("Наименование", Файл.Представление));
		Если СтрокиПлагинов.Количество() > 0 Тогда
			Если СтрокиПлагинов[0].Путь <> Файл.Значение Тогда
				ПлагинОбъект = СтрокиПлагинов[0].Ссылка.ПолучитьОбъект();
				ПлагинОбъект.Путь = Файл.Значение;
				
				ПлагинОбъект.Записать();
				
				СчОбновленных = СчОбновленных + 1;
			КонецЕсли;
		Иначе
			НовыйПлагин = Справочники.Радар_Плагины.СоздатьЭлемент();
			НовыйПлагин.Владелец     = Проект;
			НовыйПлагин.Наименование = Файл.Представление;
			НовыйПлагин.Путь         = Файл.Значение;
			
			НовыйПлагин.Записать();
			
			СчДобавленных = СчДобавленных + 1;
		КонецЕсли;

	КонецЦикла;
	
	ДобавленныхСтрокой = СтрокаСЧислом(";Добавлен %1 плагин;;Добавлено %1 плагина;Добавлено %1 плагинов;Добавлено %1 плагина",
    	СчДобавленных,
    	ВидЧисловогоЗначения.Количественное,
    	"L=ru");
	ОбновленныхСтрокой = СтрокаСЧислом(";, обновлен путь у %1 плагина;;, обновлен путь у %1 плагинов;, обновлен путь у %1 плагинов;, обновлен путь у %1 плагинов",
    	СчОбновленных,
    	ВидЧисловогоЗначения.Количественное,
    	"L=ru");
		
	Возврат ДобавленныхСтрокой + ОбновленныхСтрокой;
	
	// TODO: Наименование плагина в рамках одного проекта делаю уникальным. Т.е. надо при сохранении
	//       элемента контролировать уникальность наименования.
	
КонецФункции
